Revit 2022 API
AnalyticalModelSupport.GetCurve Method
 Retrieves the curve providing support.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public Curve GetCurve()
Visual Basic
Public Function GetCurve As Curve
Visual C++
public:
Curve^ GetCurve()
Return Value
 Represents the curve providing support, if the Support Type is Curve Support.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  Thrown when the Support Type is not Curve Support.
See Also
AnalyticalModelSupport Class
Autodesk.Revit.DB.Structure Namespace